PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
/**
 * @file rtos.c
 * This file implements a simple yet "safe" Real Time Operating System (RTOS) for the
 * MPC5643L.\n
 *   The RTOS offers a strictly priority controlled scheduler. The user code is organized
 * in processes and tasks. Any task belongs to one of the processes. Different processes
 * have different privileges. The concept is to use the process with highest privileges for
 * the safety tasks.\n
 *   A task is activated by an event; an application will repeatedly use the API
 * rtos_createEvent() to define the conditions or points in time, when the tasks have to
 * become due.\n
 *   Prior to the start of the scheduler (and thus prior to the beginning of the
 * pseudo-parallel, concurrent execution of the tasks) all later used task are registered
 * at the scheduler; an application will repeatedly use the API rtos_registerTask().\n
 *   After all needed tasks are registered the application will start the RTOS' kernel
 * by calling the API rtos_initKernel() and task scheduling begins.\n
 *   A task is mainly characterized by the owning process, the task function and a
 * priority; the C code function is invoked in the context of the process and at given
 * priority level when the task is activated. The function is executed either until the
 * task function is left or the task function or one of its sub-routines requests task
 * termination by means of a system call or the task function is aborted by an exception.\n
 *   "Context of a process" mainly relates to the memory management concept. Any process
 * has its private memory. This memory is either write-accessible only for the owning
 * process or for the owning process and all other processes with higher privileges. The
 * "or" in this statement is a matter of project configuration. A few more elements are
 * process dependent; many system calls are restricted to processes of sufficient
 * privileges.\n
 *   "Activated" does still not necessarily mean executing for a task; the more precise
 * wording is that the activation makes a task immediately and unconditionally "ready"
 * (i.e. ready for execution). If more than a single task are ready at a time then the
 * function of the task with higher priority is executed first and the function of the
 * other task will be served only after completion of the first. Several tasks can be
 * simultaneously ready and one of them will be executed, this is the one and only
 * "running" task.\n
 *   "Are ready at a time" does not necessarily mean that both tasks have been activated at
 * the same point in time. If task A of priority Pa is activated first and as only task
 * then it'll be executed regardless of its priority. If task B of priority Pb is activated
 * later, but still before A has completed then we have two tasks which have been activated
 * "at a time". The priority relation decides what happens:\n
 *   If Pa >= Pb then A is completed and B will be started and executed only after A has
 * completed.\n
 *   If Pb > Pa then task A turns from state running back to state ready and B becomes the
 * running task until it completes. Now A as remaining ready, yet uncompleted task
 * becomes the running task again and it can complete.\n
 *   With other words, if a task is activated and it has a higher priority than the running
 * task then it'll preempt the running task and it'll become the running task itself.\n
 *   If no task is ready at all then the scheduler continues the original code thread,
 * which is the code thread starting in function main() and which first registers the tasks
 * and then starts the kernel. (Everything in this code thread, which is placed behind
 * the call of API rtos_initKernel() is called the "idle task".)\n
 *   The implemented scheduling scheme leads to a strictly hierarchical execution order of
 * tasks. This scheme is sometimes referred to as scheduling of tasks of Basic Conformance
 * Class (BCC). It's simple, less than what most RTOSs offer, but still powerful enough for
 * the majority of industrial use cases.\n
 *   The activation of a task can be done by software, using API function
 * rtos_triggerEvent() or it can be done by the scheduler on a regular time base. In the
 * former case the task is called an event task, the latter is a cyclic task with fixed
 * period time.\n
 *   The RTOS implementation is tightly connected to the implementation of interrupt
 * services. Interrupt services, e.g. to implement I/O operations for the tasks, are
 * registered with prc_installINTCInterruptHandler().\n
 *   Any I/O interrupts can be combined with the tasks. Different to most RTOS we don't
 * impose a priority ordering between tasks and interrupts. A conventional design would put
 * interrupt service routines (ISR) at higher priorities than the highest task priority but
 * this is not a must. Certain constraints result from safety considerations not from
 * technical aspects.\n
 *   Effectively, there's no difference between tasks and ISRs. All what has been said for
 * tasks with respect to priority, states and preemption holds for ISRs and the combination
 * of tasks and ISRs, too.\n
 *   Compared to other "safe" RTOSs a quite little number of lines of code is required to
 * implement the RTOS - this is because of the hardware capabilities of the interrupt
 * controller INTC, which has much of an RTOS kernel in hardware. The RTOS is just a
 * wrapper around these hardware capabilities. The reference manual of the INTC partly
 * reads like an excerpt from the OSEK/VDX specification; it effectively implements the
 * basic task conformance classes BCC1 and mostly BCC2 from the standard. Since we barely
 * add software support, our operating system is by principle restricted to these
 * conformance classes.\n
 *   Basic conformance class means that a task cannot suspend intentionally and ahead of
 * its normal termination. Once started, it needs to be entirely executed. Due to the
 * strict priority scheme it'll temporarily suspend only for the sake of tasks of higher
 * priority (but not voluntarily or on own desire). Another aspect of the same is that the
 * RTOS doesn't know task to task events -- such events are usually the way intentional
 * suspension and later resume of tasks is implemented.
 *
 * Safety:\n
 *   The RTOS is based on the "unsafe" counterpart published at
 * https://github.com/PeterVranken/TRK-USB-MPC5643L/tree/master/LSM/RTOS-VLE. All
 * explanations given there still hold. In this project, we add a safety concept. This
 * needs to start with a definition of "safe" in the given context of an RTOS:\n
 *   TODOC
 *
 * Copyright (C) 2017-2019 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   rtos_createEvent
 *   rtos_registerTask
 *   rtos_grantPermissionRunTask
 *   rtos_initKernel
 *   rtos_OS_triggerEvent
 *   rtos_scFlHdlr_triggerEvent
 *   rtos_scFlHdlr_runTask
 *   rtos_getNoActivationLoss
 *   rtos_getStackReserve
 * Module inline interface
 *   rtos_OS_runTask
 *   rtos_terminateTask
 *   rtos_OS_suspendAllInterruptsByPriority
 *   rtos_suspendAllInterruptsByPriority
 *   rtos_OS_resumeAllInterruptsByPriority
 *   rtos_resumeAllInterruptsByPriority
 *   rtos_triggerEvent
 *   rtos_getNoTotalTaskFailure
 *   rtos_getNoTaskFailure
 *   rtos_suspendProcess
 * Local functions
 *   checkEventDue
 *   onOsTimerTick
 */

