PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stddef.h>
#include <stdio.h>
#include <limits.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "ihw_initMcuCoreHW.h"
#include "prc_process.h"
#include "pcp_sysCallPCP.h"
#include "rtos_defSysCalls.h"


/*
 * Defines
 */

/** Abbreviation of initialization code for a task descriptor. Default is an inactive
    task. */
#define DEFAULT_EVENT(idEv)                         \
            [idEv] = { .tiDue = 0                   \
                       , .tiCycleInMs = 0           \
                       , .noActivationLoss = 0      \
                       , .taskAry = NULL            \
                       , .noTasks = 0               \
                       , .priority = 0              \
                     }

/* The assembler code doen't have access to all defines found in the sphere of C code. This
   makes it essential to have a cross check here, were we can access both spheres. */
#if PCP_KERNEL_PRIORITY != RTOS_KERNEL_PRIORITY
# error Inconsistent definitions made in C and assembler code
#endif


/*
 * Local type definitions
 */

/** The runtime information for a task triggering event.
      Note, since we are hardware limited to eight events we use a statically allocated
    array of fixed size for all possible events. A resource optimized implementation could
    use an application defined macro to tailor the size of the array and it could put the
    task configuration data into ROM. */
typedef struct eventDesc_t
{
    /** The next due time. At this time, the event will activate the associated task set.*/
    unsigned int tiDue;

    /** The period time of the (cyclic) event in ms. The permitted range is 0..2^30-1.\n
          0 means no regular, timer controlled activation. The event is only enabled for
        software trigger using rtos_triggerEvent() (by interrupts or other tasks). */
    unsigned int tiCycleInMs;

    /** The priority of the event (and thus of all associated user tasks, which inherit the
        prioritry) in the range 1..(#RTOS_KERNEL_PRIORITY-1). Different events can share
        the same priority or have different priorities: The execution of their associated
        tasks, will then be sequenced when they become due at same time or with overlap.\n
          Note, if the event has the highest priority #RTOS_KERNEL_PRIORITY-1 then only
        those tasks can be associated, which belong to the process with highest PID in use.
        This is a safety constraint. */
    unsigned int priority;

    /** An event can be triggered by user code, using rtos_triggerEvent(). However, tasks
        belonging to less privileged processes must not generally granted permission to
        trigger events that may activate tasks of higher privileged processes. Since an
        event is not process related, we make the minimum process ID an explicitly configured,
        which is required to trigger this event.\n
          Only tasks belonging to a process with PID >= \a minPIDToTriggerThisEvent are
        permitted to trigger this event.\n
          The range of \a minPIDToTriggerThisEvent is 0 ... (#PRC_NO_PROCESSES+1). 0 and 1
        both mean, all processes may trigger the event, #PRC_NO_PROCESSES+1 means only OS code
        can trigger the event. */
    unsigned int minPIDForTrigger;

    /** We can't queue events. If at least one task is still busy, which had been activated by
        the event at its previous due time then an event (and the activation of the
        associated tasks) is lost. This situation is considered an overrun and it is counted
        for diagnostic purpose. The counter is saturated and will halt at the
        implementation maximum.
          @remark This field is shared with the external client code of the module. There,
        it is read only. Only the scheduler code must update the field. */
    unsigned int noActivationLoss;

    /** The set of associated tasks, which are activated by the event, is implemented by an
        array and the number of entries. Here we have the array. */
    const prc_userTaskConfig_t * taskAry;

    /** The set of associated tasks, which are activated by the event, is implemented by an
        array and the number of entries. Here we have the number of entries. */
    unsigned int noTasks;

} eventDesc_t;


/*
 * Local prototypes
 */

/* The prototypes of all possible software interrupt service routines. */
#define swInt(idEv)    static void swInt##idEv(void);
swInt(0)
swInt(1)
swInt(2)
swInt(3)
swInt(4)
swInt(5)
swInt(6)
swInt(7)
#undef swInt


/*
 * Data definitions
 */

/** The list of all tasks. */
static prc_userTaskConfig_t _taskCfgAry[RTOS_MAX_NO_USER_TASKS]
                                                        SECTION(.data.OS._taskCfgAry) =
    { [0 ... (RTOS_MAX_NO_USER_TASKS-1)] = { .taskFct = NULL
                                             , .tiTaskMax = 0
                                             , .PID = 0
                                           }
    };

/** The list of all process initialization tasks. */
static prc_userTaskConfig_t _initTaskCfgAry[1+PRC_NO_PROCESSES]
                                                        SECTION(.data.OS._initTaskCfgAry) =
    { [0 ... PRC_NO_PROCESSES] = { .taskFct = NULL
                                   , .tiTaskMax = 0
                                   , .PID = 0
                                 }
    };

/** The number of registered tasks. The range is 0..#RTOS_MAX_NO_USER_TASKS. */
static unsigned int _noTasks SECTION(.sdata.OS._noTasks) = 0;

/** The list of task activating events. */
static eventDesc_t _eventAry[RTOS_MAX_NO_EVENTS] SECTION(.data.OS._eventAry) =
    { DEFAULT_EVENT(0), DEFAULT_EVENT(1), DEFAULT_EVENT(2), DEFAULT_EVENT(3)
      , DEFAULT_EVENT(4), DEFAULT_EVENT(5), DEFAULT_EVENT(6), DEFAULT_EVENT(7)
    };

/** The number of created events. The range is 0..8. The events are implemented by
    software interrupts and these are limited by hardware to a number of eight. */
static unsigned int _noEvents SECTION(.sdata.OS._noEvents) = 0;

/** Time increment of one tick of the RTOS system clock. It is set at kernel initialization
    time to the configured period time of the system clock in Milliseconds
    (#RTOS_CLOCK_TICK_IN_MS). This way the unit of all time designations in the RTOS API
    always stays Milliseconds despite of the actually chosen clock rate. (An application of
    the RTOS can reduce the clock rate to the lowest possible value in order to save
    overhead.) The normal settings are a clock rate of 1 kHz and
    #RTOS_CLOCK_TICK_IN_MS=1.\n
      The variable is initially set to zero to hold the scheduler during RTOS
    initialization. */
static unsigned long _tiOsStep SECTION(.sdata.OS._tiStepOs) = 0;

/** RTOS sytem time in Milliseconds since start of kernel. */
static unsigned long _tiOs SECTION(.sdata.OS._tiOs) = (unsigned long)-1;

/** The option for inter-process communication to let a task of process A run a task in
    process B (system call rtos_runTask()) is potentially harmful, as the started task can
    destroy on behalf of process A all data structures of the other process B. It's of
    course not generally permittable. An all-embracing privilege rule cannot be defined
    because of the different use cases of the mechanism. Therefore, we have an explicit
    table of granted permissions, which can be configured at startup time as an element of
    the operating system initialization code.\n
      The bits of the word correspond to the 16 possible combinations of four possible
    caller processes in four possible target processes.
      By default, no permission is granted. */
#if PRC_NO_PROCESSES == 4
static uint16_t SDATA_OS(_runTask_permissions) = 0;
#else
# error Implementation depends on four being the number of processes
#endif


