PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
/*
 * Function implementation
 */

/*
 * The SW interrupt service routines are implemented by macro and created multiple times.
 * Each function implements one event. It activates all associated tasks and acknowledges
 * the software interrupt flag.
 */
#define swInt(idEv)                                                                 \
    static void swInt##idEv(void)                                                   \
    {                                                                               \
        const prc_userTaskConfig_t *pTaskConfig = &_eventAry[idEv].taskAry[0];      \
        unsigned int u = _eventAry[idEv].noTasks;                                   \
        while(u-- > 0)                                                              \
        {                                                                           \
            if(pTaskConfig->PID > 0)                                                \
                rtos_OS_runTask(pTaskConfig, /* taskParam */ idEv);                 \
            else                                                                    \
                ((void (*)(void))pTaskConfig->taskFct)();                           \
                                                                                    \
            ++ pTaskConfig;                                                         \
        } /* End while(Run all tasks associated with the event) */                  \
                                                                                    \
        /* Acknowledge the interrupt bit of the software interrupt. */              \
        *((vuint8_t*)&INTC.SSCIR0_3.R + (idEv)) = 0x01;                             \
    }

swInt(0)
swInt(1)
swInt(2)
swInt(3)
swInt(4)
swInt(5)
swInt(6)
swInt(7)
#undef swInt


/**
 * Process the up to eight events. They are checked for becoming due meanwhile and the
 * associated tasks are made ready in case (i.e. the software interrupt is raised in the
 * INTC).
 */
static inline void checkEventDue(void)
{
    vuint8_t *pINTC_SSCIR = (vuint8_t*)&INTC.SSCIR0_3.R;
    unsigned int idxEvent;
    eventDesc_t *pEvent = &_eventAry[0];

    /* In the implementation of this routine we neglect a minor race condition in
       recognizing and reposting an activation loss. If #RTOS_KERNEL_PRIORITY is lower than
       15 and if an ISR with priority greater than #RTOS_KERNEL_PRIORITY makes use of
       rtos_OS_triggerEvent() and if this function and the ISR try to trigger one and the
       same event at the same time then an activation loss may or may not be reported. The
       expected and reasonable behavior is not affected:\n
         The event is surely triggered if it was not yet triggered. The activation loss
       counter should be incremented by one (as there is surely one instead of two
       simultaneously attempted triggers) but it may be that none of the two competitors
       have found the event already triggered and the counter is not incremented.\n
         The event is surely not triggered if it was already triggered. Both competitors
       will recognize the situation but now the race condition is in incrementing the
       counter; one may override the increment of the other resulting in the same effect -
       the counter is not surely incremented by two but may be incremented only by one.\n
         We could easily sort this out by adding a critical section. We don't do this for
       the follwoing reasons:\n
         We can put the test-and-modify operation on the interrupt flag into a critical
       section. Then we need to do this up to eight times, which is expensive.\n
         We can put the entire loop into the critical section, which makes the duration of
       the critical section long - and we are talking about a scenario with IRQs of very
       high priority.\n
         The probablity of ever seeing the effect is little. If we have an ISR of high
       priority using rtos_OS_triggerEvent() then it will most likely trigger a dedicated,
       non-cyclic event, but not one, which is regularly triggered by the scheduler, too.\n
         Pathologic contructs, in which two or more high prior ISRs compete with the
       scheduler for one and the same event are not considered here, the results are
       accordingly. */
    for(idxEvent=0; idxEvent<_noEvents; ++idxEvent, ++pEvent, ++pINTC_SSCIR)
    {
        if(pEvent->tiCycleInMs > 0)
        {
            if((signed int)(pEvent->tiDue - _tiOs) <= 0)
            {
                /* Task is due. Read software interrupt bit. If it is still set then we
                   have a task overrun otherwise we activate task by requesting the
                   software interrupt. */
                if(*pINTC_SSCIR == 0)
                {
                    /* Put task into ready state (and leave the activation to the INTC). */
                    *pINTC_SSCIR = 3;

                    /* Operation successful. */
                }
                else
                {
                    /* CLRi is still set, interrupt has not completed yet, task has not
                       terminated yet. We neither set nor clear the interrupt bit. */

                    /* Counting the loss events requires a critical section. The loss
                       counter can be written concurrently from a task invoking
                       rtos_triggerEvent(). Here, the implementation of the critical
                       section is implicit, this code is running on highest interrupt
                       level. */
                    const unsigned int noActivationLoss = _eventAry[idxEvent].noActivationLoss
                                                          + 1;
                    if(noActivationLoss > 0)
                        _eventAry[idxEvent].noActivationLoss = noActivationLoss;
                }

                /* Adjust the due time. */
                /// @todo We can queue task activations for cyclic tasks by not adjusting
                // the due time. Some limitation code is required to make this safe.
                // Alternatively, we can implement a queue length of one by acknowledging
                // the IRQ flag on entry into the SW IRQ handler: The next SW IRQ can be
                // requested while the previous one is still being handled.
                pEvent->tiDue += pEvent->tiCycleInMs;

            } /* End if(Event is due?) */
        }
        else
        {
            /* Non regular events: nothing to be done. These events are triggered only by
               explicit software call of rtos_triggerEvent(). */

