PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
        } /* End if(Timer or application software activated task?) */
    } /* End for(All configured events) */

} /* End of checkEventDue */



/**
 * The OS default timer handler. In function rtos_initKernel(), it is associated with the
 * PIT0 interrupt. You must not call this function yourself. The routine is invoked once
 * every #RTOS_CLOCK_TICK_IN_MS Milliseconds and triggers most of the scheduler decisions.
 * The application code is expected to run mainly in regular tasks and these are activated
 * by this routine when they become due. All the rest is done by the interrupt controller
 * INTC.
 *   @remark
 * The INTC priority at which this function is executed is configured as
 * #RTOS_KERNEL_PRIORITY. One can set it to the highest available interrupt priority, but
 * this is not a must. Chosing the highest possible priority would be driven by the concept
 * that the scheduler can force the execution of an application task in disfavor of any
 * other context. No difference is then made between interrupt service routines and regular
 * application tasks.\n
 *   However, most RTOSs distiguish between pure interrupt service routines and application
 * tasks and let the latter generally have a priority lower than all of the former. And
 * they would never preempt an interrupt in favor of an application task. If this behavior
 * is modelled then the priority demand would change to "the highest application task
 * priority plus one".\n
 *   An important aspect in this discussion is the availablity of the priority ceiling
 * protocol (PCP) for mutual exclusion of contexts. It is available only up to and
 * including priority level #RTOS_KERNEL_PRIORITY-2 (#RTOS_KERNEL_PRIORITY-1 is reserved
 * for non-suppressible safety tasks). An ISR running above this level cannot have a
 * critical section with user code and data exchange needs to appy more complicated
 * techniques, e.g. double-buffering.
 */
static void onOsTimerTick(void)
{
    /* Note, the scheduler function needs to run at highest priority, which means that no
       task or ISR can preempt this code. No mutual exclusion code is required. */

    /* Update the system time. */
    _tiOs += _tiOsStep;

    /* The scheduler is most simple; the only condition to make a task ready is the next
       periodic due time. The task activation is fully left to the hardware of the INTC and
       we don't have to bother with priority handling or task/context switching. */
    checkEventDue();

        /* Acknowledge the timer interrupt in the causing HW device. */
    PIT.TFLG0.B.TIF = 0x1;

} /* End of onOsTimerTick */



/**
 * Creation of an event. The event can be cyclically triggering or software triggerd.
 * An event is needed to activate a user task. Therefore, any reasonable application will
 * ceate at least one event.\n
 *   This function is repeatedly called by the application code for each required event.
 * All calls of this function need to be done prior to the start of the kernel using
 * rtos_initKernel().\n
 *   @return
 * All events are identified by a positive integer. Normally this ID is returned. The
 * maximum number of events is limited to #RTOS_MAX_NO_EVENTS by hardware constraints. If
 * the event cannot be created due to this constraint or if the event descriptor contains
 * invalid data then the function returns (unsigned int)-1. An assertion in the calling
 * code is considered appropriate to handle the error because it'll always be a static
 * configuration error.
 *   Note, it is guaranteed to the caller that the returned ID is not any meaningless
 * number. Instead, the ID is counted from zero in order of creating events. The first
 * call of this function will return 0, the second 1, and so on. This simplifies ID
 * handling in the application code, constants can mostly be applied as the IDs are
 * effectively known at compile time.
 *   @param pEventDesc
 * The properties of the requested event, mainly timing related.\n
 *   The object needs to be alive only during the call of this function, the proerties are
 * copied into the kernel owned runtime data structures.\n
 *   \a *pEventDesc contains the priority of the event (and the associated user tasks it'll
 * activate). Note, the order in which events are created can affect the priority in a
 * certain sense. If two events are created with same priority and when they at runtime
 * become due at the same OS time tick then the earlier created event will trigger its
 * associated user tasks before the later ceated event.
 *   @remark
 * Never call this function after the call of rtos_initKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
unsigned int rtos_createEvent(const rtos_eventDesc_t *pEventDesc)
{
    /* The number of events is constraint by hardware (INTC) */
    if(_noEvents >= RTOS_MAX_NO_EVENTS)
        return (unsigned int)-1;

    /* The INTC permits priorities only in the range 0..15 and we exclude 0 since such a
       task would never become active. We furthermore exclude priorities equal to or
       greater then the one of the scheduler to avoid unwanted blocking states. */
    if(pEventDesc->priority == 0  ||  pEventDesc->priority >= RTOS_KERNEL_PRIORITY)
        return (unsigned int)-1;

    /* Check settings for non regularly activated tasks. */
    if(pEventDesc->tiCycleInMs == 0)
    {
        /* Avoid a useless and misleading setting. */
        if(pEventDesc->tiFirstActivationInMs != 0)
            return (unsigned int)-1;
    }
    
    /* The full 32 Bit range is avoided for time designations in order to have safe and
       unambiguous before and after decisions in a cyclic time model.
         Furthermore, no task must have the initial due time of 0xffffffff in order to not
       invalidate the startup logic of the scheduler (see rtos_initKernel()). */
    else if(((pEventDesc->tiCycleInMs | pEventDesc->tiFirstActivationInMs) & 0xc0000000) != 0)
        return (unsigned int)-1;

