PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
    /* Is the PID constraint plausible? */
    if(pEventDesc->minPIDToTriggerThisEvent > PRC_NO_PROCESSES+1)
        return (unsigned int)-1;

    /* Add the new event to the array and initialize the data structure. */
    _eventAry[_noEvents].tiCycleInMs = pEventDesc->tiCycleInMs;
    _eventAry[_noEvents].tiDue = pEventDesc->tiFirstActivationInMs;
    _eventAry[_noEvents].priority = pEventDesc->priority;
    _eventAry[_noEvents].minPIDForTrigger = pEventDesc->minPIDToTriggerThisEvent;
    _eventAry[_noEvents].noActivationLoss = 0;
    _eventAry[_noEvents].taskAry = NULL;
    _eventAry[_noEvents].noTasks = 0;

    return _noEvents++;

} /* End of rtos_createEvent */



/**
 * Registration of a user task. Normal, event activated tasks and process initialization
 * tasks can be registered for later execution. This function is repeatedly called by the
 * application code as often as tasks are required.\n
 *   All calls of this function need to be done prior to the start of the kernel using
 * rtos_initKernel().
 *   @return
 * \a true if the task could be registered. The maximum number of normal tasks is limited
 * to #RTOS_MAX_NO_USER_TASKS (regardless, how they are distributed among processes). The
 * maximum number of initialization tasks is one per process or for the OS. If the limit is
 * exceeded or if the task descriptor is invalid then the function returns \a false. An
 * assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param pTaskDescAPI
 * The details of the registered task: The process it belongs to, the task function and the
 * time budget for execution.
 *   @param idEvent
 * Any (normal) task is activated by an event and a task without related event is useless.
 * This call associates the registered task with an already created event. See
 * rtos_createEvent().\n
 *   The association of the task with the process is made through field \a
 * pTaskDescAPI->PID.\n
 *   The order of registration of several tasks with one and the same event matters. The
 * tasks will be acivated in order of registration whenever the event becomes due or is
 * triggered by software.\n
 *   If a process or OS initialization task is registered, then \a idEvent is set to
 * #RTOS_EVENT_ID_INIT_TASK. It is allowed not to register an init task for a process or
 * for the OS but it is not possible to register more than one (or to re-register an) init
 * task for a given process or the OS.\n
 *   The order of registration doesn't matter for initialization tasks! The OS
 * initialization task is served first. Processes are always initialized in order of rising
 * process ID. The most privileged process is served last and can thus override descisions
 * of its less privileged predecessors.
 *   @remark
 * Never call this function after the call of rtos_initKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 *   @todo
 * We should consider an enumeration of different error return codes. The function
 * implementation anyway makes the differentiation. Same for rtos_createEvent() and
 * rtos_initKernel().
 */
bool rtos_registerTask(const rtos_taskDesc_t *pTaskDescAPI, unsigned int idEvent)
{
    /* The scheduler should be in halted state. */
    if(_tiOsStep != 0)
        return (unsigned int)-1;

    /* The event need to be created before the task can be registered. */
    if(idEvent >= _noEvents  &&  idEvent != RTOS_EVENT_ID_INIT_TASK)
        return (unsigned int)-1;

    /* The process ID needs to be in the fixed and limited range. */
    if(pTaskDescAPI->PID > PRC_NO_PROCESSES)
        return (unsigned int)-1;

    /* The number of runtime tasks is constraint by compile time configuration. */
    if(_noTasks >= RTOS_MAX_NO_USER_TASKS  &&  idEvent != RTOS_EVENT_ID_INIT_TASK)
        return (unsigned int)-1;

    /* Task function not set. */
    if(pTaskDescAPI->userTaskFct == NULL)
        return (unsigned int)-1;

    /* Check execution budget: There's an upper boundary for user tasks and OS task cannot
       have deadline monitoring at all. */
    if(pTaskDescAPI->tiTaskMaxInUS > RTOS_TI_DEADLINE_MAX_IN_US
       ||  pTaskDescAPI->PID == 0  && pTaskDescAPI->tiTaskMaxInUS > 0
      )
    {
        return (unsigned int)-1;
    }

    /* We make the distinction between normal runtime tasks and initialization tasks. */
    if(idEvent == RTOS_EVENT_ID_INIT_TASK)
    {
        /* An initialization task must not be configured repeatedly for one and the same
           process. */
        const unsigned int idxP = pTaskDescAPI->PID;
        assert(idxP < sizeOfAry(_initTaskCfgAry));
        if(_initTaskCfgAry[idxP].taskFct != NULL)
            return (unsigned int)-1;

        /* Typecast: The assembler interface offers an extended function signature, which
           we cannot exploit in this context. */
        _initTaskCfgAry[idxP].taskFct = idxP == 0? (int32_t (*)(uint32_t, uint32_t))
                                                   pTaskDescAPI->osTaskFct
                                                 : (int32_t (*)(uint32_t, uint32_t))
                                                   pTaskDescAPI->userTaskFct;

        _initTaskCfgAry[idxP].tiTaskMax = pTaskDescAPI->tiTaskMaxInUS * 120;
        _initTaskCfgAry[idxP].PID = pTaskDescAPI->PID;
    }
    else
    {
        /* Add the new runtime task to the array. All tasks associated with an event need
           to form a consecutive list. We need to find the right location to insert the
           task and we need to consider an update of all events with higher index. */
        unsigned int idxEv
                   , noTasksBefore;
        for(noTasksBefore=0, idxEv=0; idxEv<=idEvent; ++idxEv)
            noTasksBefore += _eventAry[idxEv].noTasks;

        unsigned int idxTask;
        for(idxTask=noTasksBefore; idxTask<_noTasks; ++idxTask)
            _taskCfgAry[idxTask+1] = _taskCfgAry[idxTask];

        /* Typecast: The assembler interface offers an extended function signature, which
           we cannot exploit in this context. */
        _taskCfgAry[noTasksBefore].taskFct = pTaskDescAPI->PID == 0
                                             ? (int32_t (*)(uint32_t, uint32_t))
                                               pTaskDescAPI->osTaskFct
                                             : (int32_t (*)(uint32_t, uint32_t))
                                               pTaskDescAPI->userTaskFct;
        _taskCfgAry[noTasksBefore].tiTaskMax = pTaskDescAPI->tiTaskMaxInUS * 120;
        _taskCfgAry[noTasksBefore].PID = pTaskDescAPI->PID;
        ++ _noTasks;

        /* Associate the task with the specified event. */
        if(_eventAry[idEvent].taskAry == NULL)
        {
            _eventAry[idEvent].taskAry = &_taskCfgAry[noTasksBefore];
            assert(_eventAry[idEvent].noTasks == 0);
        }
        ++ _eventAry[idEvent].noTasks;

        for(; idxEv<_noEvents; ++idxEv)
            if(_eventAry[idxEv].taskAry != NULL)
                ++ _eventAry[idxEv].taskAry;
    }

