PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
    return true;

} /* End of rtos_registerTask */



/**
 * Operating system initialization function: Grant permissions for using the service
 * rtos_runTask to particular processes. By default, the use of that service is not
 * allowed.\n
 *   By principle, offering service rtos_runTask makes all processes vulnerable, which are
 * allowed as target for the service. A failing, straying process can always hit some ROM
 * code executing the system call with arbitrary register contents, which can then lead to
 * errors in an otherwise correct process.\n
 *   This does not generally break the safety concept, the potentially harmed process can
 * for example be anyway supervised by another, unaccessible supervisory process.
 * Consequently, we can offer the service at least on demand. A call of this function
 * enables the service for a particular pair of calling process and targeted process.
 *   @param pidOfCallingTask
 * The tasks belonging to process with PID \a pidOfCallingTask are granted permission to
 * run a task in another process. The range is 1 .. #PRC_NO_PROCESSES, which is
 * double-checked by assertion. 
 *   @param targetPID
 * The tasks started with service rtos_runTask() may be run in process with PID \a
 * targetPID. The range is 1 .. maxPIDInUse-1, which is double-checked later.\n
 *   \a pidOfCallingTask and \a targetPID must not be identical, which is double-checked by
 * assertion. 
 *   @remark
 * It would break the safety concept if we permitted the process with highest privileges to
 * become the target of the service. This is double-checked not here (when it is not yet
 * defined, which particular process that will be) but as part of the RTOS startup
 * procedure; a bad configuration can therefore lead to a later reported run-time error.
 *   @remark
 * This function must be called from the OS context only. It is intended for use in the
 * operating system initialization phase. It is not reentrant. The function needs to be
 * called prior to rtos_initKernel().
 */
void rtos_grantPermissionRunTask(unsigned int pidOfCallingTask, unsigned int targetPID)
{
    /* targetPID <= 3: Necessary but not sufficient to double-check
       "targetPID <= maxPIDInUse-1". */
    assert(pidOfCallingTask >= 1  &&  pidOfCallingTask <= 4
           &&  targetPID >= 1  &&  targetPID <= 3
          );

    /* It may be useful to grant process A the right to run a task in process A. This
       effectively implements a try/catch mechanism. The run task function has the option
       to abort its action at however deeply nested function invocation and using
       rtos_terminateTask(). Control returns to the call of rtos_runTask and the caller
       gets a negative response code as indication (otherwise a positive value computed by
       the called function). The called function belongs to the same process and its
       potential failures can of course harm the calling task, too. This does not break
       our safety concept, but nonetheless, offering a kind of try/catch could easily be
       misunderstood as a kind of full-flavored run-time protection, similar to what we
       have between processes. This potential misunderstanding makes the use of such a
       try/catch untransparent and therefore unsafe. Hence, we do not allow it here. */
    assert(targetPID != pidOfCallingTask);
    
    /* Caution, the code here depends on macro PRC_NO_PROCESSES being four and needs to be
       consistent with the implementation of rtos_scFlHdlr_runTask(). */
#if PRC_NO_PROCESSES != 4
# error Implementation requires the number of processes to be four
#endif
    const unsigned int idxCalledPrc = targetPID - 1u;
    const uint16_t mask = 0x1 << (4u*(pidOfCallingTask-1u) + idxCalledPrc);
    _runTask_permissions |= mask;

} /* End of rtos_grantPermissionRunTask */



/**
 * Initialization and start of the RTOS kernel.\n
 *   The function initializes a hardware device to produce a regular clock tick and
 * connects the OS schedule function onOsTimerTick() with the interrupt raised by this
 * timer device. After return, the RTOS is running with a regular clock tick for scheduling
 * the tasks. Period time is #RTOS_CLOCK_TICK_IN_MS Milliseconds.\n
 *   The function can be called before or after the External Interrupts are enabled at the
 * CPU (see ihw_resumeAllInterrupts()). Normal behavior is however, no to resume the
 * interrupt processing before and let this be done by rtos_initKernel().
 *   @return
 * The function returns \a false is a configuration error is detected. The software must
 * not start up in this case. Normally, you will always receive a \a true. Since it is only
 * about static configuration, the returned error may be appropriately handled by an
 * assertion.
 *   @remark
 * The RTOS kernel applies the Periodic Interrupt Timer 0 (PIT0) as clock source. This
 * timer is reserved to the RTOS and must not be used at all by some other code.
 *   @param
 * All application tasks need to be registered before invoking this function, see
 * rtos_registerTask().
 *   @remark
 * This function must be called from the OS context only. The call of this function will
 * end the operating system initialization phase.
 */
bool rtos_initKernel(void)
{
    /* The user must have registered at minimum one task and must have associated it with a
       event. */
    bool isConfigOk = _noEvents > 0  &&  _noTasks > 0  &&  _tiOsStep == 0;

    /* Fill all process stacks with the empty-pattern, which is applied for computing the
       stack usage. */
    bool isProcessConfiguredAry[1+PRC_NO_PROCESSES] = {[0 ... PRC_NO_PROCESSES] = false};
    if(isConfigOk)
        isConfigOk = prc_initProcesses(isProcessConfiguredAry);

    unsigned int idxTask
               , maxPIDInUse = 0;
    /* Find the highest PID in use. */
    for(idxTask=0; idxTask<_noTasks; ++idxTask)
        if(_taskCfgAry[idxTask].PID > maxPIDInUse)
            maxPIDInUse = _taskCfgAry[idxTask].PID;

    /* A task must not belong to an invalid configured process. This holds for init and for
       run time tasks. */
    unsigned int idxP;
    if(isConfigOk)
    {
        for(idxTask=0; idxTask<_noTasks; ++idxTask)
        {
            assert(_taskCfgAry[idxTask].PID < sizeOfAry(isProcessConfiguredAry));
            if(!isProcessConfiguredAry[_taskCfgAry[idxTask].PID])
                isConfigOk = false;

        } /* For(All registered runtime tasks) */

        for(idxP=0; idxP<1+PRC_NO_PROCESSES; ++idxP)
        {
            /* Note, the init task array is - different to the runtime task array
               _taskCfgAry - ordered by PID. The field PID in the array entries are
               redundant. A runtime check is not appropriate as this had happened at
               registration time. We can place a simple assertion here. */
            if(_initTaskCfgAry[idxP].taskFct != NULL)
            {
                assert(_initTaskCfgAry[idxP].PID == idxP);
                if(!isProcessConfiguredAry[idxP])
                    isConfigOk = false;
            }
        } /* for(All possibly used processes) */
    }

    /* Now knowing, which is the process with highest privileges we can double-check the
       permissions granted for using the service rtos_runTask(). It must not be possible to
       run a task in the process with highest privileges. */
    if(isConfigOk)
    {
        /* Caution: Maintenance of this code is required consistently with
           rtos_grantPermissionRunTask() and rtos_scFlHdlr_runTask(). */
        assert(maxPIDInUse >= 1  &&  maxPIDInUse <= 4);
        const uint16_t mask = 0x1111 << (maxPIDInUse-1);
        isConfigOk = (_runTask_permissions & mask) == 0;
    }
    
    /* We could check if a process, an init task is registered for, has a least one runtime
       task. However, it is not harmful if not and there might be pathologic applications,
       which solely consist of I/O driver callbacks. */

