PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
    if(isConfigOk)
    {
        unsigned int idxEv;
        for(idxEv=0; idxEv<_noEvents; ++idxEv)
        {
            /* Check task configuration: Events without an associated task are useless and
               point to a configuration error. */
            if(_eventAry[idxEv].noTasks == 0)
                isConfigOk = false;

            /* If an event has the highest possible priority #RTOS_KERNEL_PRIORITY-1 then
               only those tasks can be associated, which belong to the process with highest
               PID in use or OS tasks. This is a safety constraint. */
            if(_eventAry[idxEv].priority == RTOS_KERNEL_PRIORITY-1)
            {
                for(idxTask=0; idxTask<_eventAry[idxEv].noTasks; ++idxTask)
                {
                    const unsigned int PID = _eventAry[idxEv].taskAry[idxTask].PID;
                    if(PID > 0  &&  PID != maxPIDInUse)
                        isConfigOk = false;
                }
            } /* End if(Unblockable priority is in use by event) */
        } /* for(All registered events) */
    }

    /* After checking the static configuration, we can enable the dynamic processes.
       Outline:
       - Disable all processes (which is their initial state). Once we enable the
         interrupts, the I/O drivers start working and they may invoke callbacks into the
         processes. The execution of these callbacks will be inhibited
       - Disable the scheduler to trigger any events (which is its initial state).
         Triggering events would not cause any user tasks to execute (processes still
         disabled) but their due counters would already run and the configured startup
         conditions would not be met later when enabling the processes
       - Globally enable interrupt processing. I/O drivers and OS clock tick are running.
         This is a prerequisite for the deadline monitoring, which we want to have in place
         already for the init tasks
       - Sequentially execute all configured process initialization tasks. There are no
         crosswise race condition and nor with user tasks or I/O driver callbacks
       - Enable the processes and release the scheduler; scheduler, user tasks and I/O
         driver's callbacks start running */

    /* Stop the scheduler. It won't run although the RTOS clock starts spinning. We don't
       want to see a running user task during execution of the init tasks. */
    _tiOs = (unsigned long)-1;
    _tiOsStep = 0;

    /* We can register all SW interrupt service routines. */
    if(isConfigOk)
    {
        /* Install all software interrupts, which implement the events. */
        #define INSTALL_SW_IRQ(idEv)                                            \
            if(idEv < _noEvents)                                                \
            {                                                                   \
                prc_installINTCInterruptHandler( &swInt##idEv                   \
                                               , /* vectorNum */ idEv           \
                                               , _eventAry[idEv].priority       \
                                               , /* isPreemptable */ true       \
                                               );                               \
            }
        INSTALL_SW_IRQ(0)
        INSTALL_SW_IRQ(1)
        INSTALL_SW_IRQ(2)
        INSTALL_SW_IRQ(3)
        INSTALL_SW_IRQ(4)
        INSTALL_SW_IRQ(5)
        INSTALL_SW_IRQ(6)
        INSTALL_SW_IRQ(7)
        #undef INSTALL_SW_IRQ

        /* Disable all PIT timers during configuration. */
        PIT.PITMCR.R = 0x2;

        /* Install the interrupt servive routine for cyclic timer PIT 0. It drives the OS
           scheduler for cyclic task activation. */
        prc_installINTCInterruptHandler( &onOsTimerTick
                                       , /* vectorNum */ 59
                                       , RTOS_KERNEL_PRIORITY
                                       , /* isPremptable */ true
                                       );

        /* Peripheral clock has been initialized to 120 MHz. To get a 1ms interrupt tick we
           need to count till 120000. We configure an interrupt rate of RTOS_CLOCK_TICK_IN_MS
           Milliseconds.
             -1: See MCU reference manual, 36.5.1, p. 1157. */
        PIT.LDVAL0.R = 120000u*RTOS_CLOCK_TICK_IN_MS -1;

        /* Enable interrupts by this timer and start it. */
        PIT.TCTRL0.R = 0x3;

        /* Enable timer operation and let them be stopped on debugger entry. Note, this is a
           global setting for all four timers, even if we use and reserve only one for the
           RTOS. */
        PIT.PITMCR.R = 0x1;
    }

    /* All processes are initialized by prc_initProcesses() in stopped state: We don't want
       to see a callback from an I/O driver after resuming interrupt processing and while
       an init task is executed. Note, it doesn't really matter if interrupt processing was
       resumed already before. */
    if(isConfigOk)
        ihw_resumeAllInterrupts();

    /* When we get here (and if we didn't see a configuration error) then all kernel
       interrupts are configured, interrupts occur and are processed, but no user tasks are
       activated nor will an I/O driver run a callback. We can safely start our process
       initialization tasks. */

    /* Run all process initialization in order of increasing PID. A process with higher
       privileges is initialized after another with less privileges. The higher
       privileged could override settings made by its predecessor. */
    for(idxP=0; isConfigOk && idxP<1+PRC_NO_PROCESSES; ++idxP)
    {
        /* The specification of an initialization task is an option only. Check for NULL
           pointer. */
        if(_initTaskCfgAry[idxP].taskFct != NULL)
        {
            if(isProcessConfiguredAry[idxP])
            {
                /* Everything is alright. Run the initialization task. A negative return
                   value is defined to be an error. (This needs to be considered by the
                   implementation of the task.) */
                int32_t resultInit;
                if(_initTaskCfgAry[idxP].PID == 0)
                {
                    /* OS initialization function: It is a normal sub-function code; we are
                       here in the OS context. */
                    resultInit = ((int32_t (*)(void))_initTaskCfgAry[idxP].taskFct)();
                }
                else
                    resultInit = ivr_runInitTask(&_initTaskCfgAry[idxP]);

