PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.c
                if(resultInit < 0)
                    isConfigOk = false;
            }
            else
            {
                /* An initialization task must not be registered for a process, which is not
                   configured. This had been checked above and we can never get here. */
                assert(false);
            }
        } /* End if(Init task configured for process?) */
    } /* End for(All possible processes) */

    /* After successfully completing all the initialization tasks, we can release the
       scheduler and the processes. We do this in a critical section in order to not
       endanger the specified relationship of initial task activations (specified in terms
       of task priority, period time and initial due time). */
    if(isConfigOk)
    {
        ihw_suspendAllInterrupts();

        /* Process state: Set to running (not zero) only if configuration generally okay. */
        unsigned int idxP;
        for(idxP=1; idxP<1+PRC_NO_PROCESSES; ++idxP)
            if(isProcessConfiguredAry[idxP])
                prc_processAry[idxP-1].state = 1;
        
        /* Release scheduler. */
        _tiOsStep = RTOS_CLOCK_TICK_IN_MS;

        ihw_resumeAllInterrupts();
    }

    /* @todo Shall we offer idle tasks per process? If so, we cannot leave the routine but
       would need to enter an infinite loop - and had to offer such a function for OS, too.
       For consistency reasons this would require an init function for OS, too. */

    return isConfigOk;

} /* End of rtos_initKernel */




/**
 * Trigger an event to activate all associated tasks. A event, which had been registered
 * with cycle time zero is normally not executed. It needs to be triggered with this
 * function in order to make its associated tasks run once, i.e. to make its task functions
 * executed once as result of this call.\n
 *   This function can be called from any task or ISR. However, if the calling task belongs
 * to the set of tasks associated with \a idEvent, then it'll have no effect but an
 * accounted activation loss; an event can be re-triggered only after all associated
 * activations have been completed. There is no activation queueing. The function returns \a
 * false in this case.\n
 *   Note, the system respects the priorities of the activated tasks. If a task of priority
 * higher than the activating task is activated by the triggered event then the activating
 * task is immediately preempted to the advantage of the activated task. Otherwise the
 * activated task is chained and executed after the activating task.
 *   @return
 * There is no activation queueing. If the aimed event is not yet done with processing its
 * previous triggering then the attempt is rejected. The function returns \a false and the
 * activation loss counter of the event is incremented. (See rtos_getNoActivationLoss().)
 *   @param idEvent
 * The ID of the event to activate as it had been got by the creation call for that event.
 * (See rtos_createEvent().)
 *   @remark
 * The function is indented to start a non cyclic task by application software trigger but
 * can be applied to cyclic tasks, too. In which case the task function of the cyclic task
 * would be invoked once additionally. Note, that an event activation loss is not unlikely in
 * this case; the cyclic task may currently be busy.
 *   @remark
 * It is not forbidden but useless to let a task activate itself by triggering the event it
 * is associated with. This will have no effect besides incrementing the activation loss
 * counter for that event.
 *   @remark
 * This function must be called from the OS context only. It may be called from an ISR to
 * implement delegation to a user task.
 */
bool rtos_OS_triggerEvent(unsigned int idEvent)
{
    /* The events are related to the eight available software interrupts. Each SWIRQ is
       controlled by two bits in one out of two status registers of the INTC (RM, 28, p.
       911ff). Access to INTC_SSCIR is described at 28.4.2 and 28.4.7. */
    bool intFlagNotYetSet = true;
    vuint8_t * const pINTC_SSCIR = (vuint8_t*)&INTC.SSCIR0_3.R + idEvent;

    /* To make this function reentrant with respect to one and the same target SW IRQ, we
       need to encapsulate the flag-test-and-test operation in a critical section.
         As a side effect, we can use the same critical section for race condition free
       increment of the error counter in case. */
    const uint32_t msr = ihw_enterCriticalSection();
    {
        /* Read software interrupt bit of the task. If it is still set then we have an
           overrun of the associated tasks. Otherwise we activate the tasks by requesting
           the related software interrupt. */
        if(*pINTC_SSCIR == 0)
        {
            /* Put task into ready state (and leave the activation to the INTC). It
               is important to avoid a read-modify-write operation, don't simply
               set a single bit, the other three interrupts in the same register
               could be harmed.
                 The time gap between register read and write shapes a race condition with
               the scheduler for cyclic events and generally with other tasks using this
               function. An activation loss may be not recognized. */
            *pINTC_SSCIR = 0x3;

            /* Operation successful. */
        }
        else
        {
            /* CLRi is still set, interrupt has not completed yet, task has not terminated
               yet. We neither set nor clear the interrupt bit. */
            const unsigned int noActivationLoss = _eventAry[idEvent].noActivationLoss + 1;
            if(noActivationLoss > 0)
                _eventAry[idEvent].noActivationLoss = noActivationLoss;

            /* Activation failed. */
            intFlagNotYetSet = false;
        }
    }
    ihw_leaveCriticalSection(msr);

    return intFlagNotYetSet;

} /* End of rtos_OS_triggerEvent */



/**
 * System call handler implementation to trigger an event (and to activate the associated
 * tasks). Find all details in rtos_OS_triggerEvent().
 *   @return
 * \a true if activation was possible, \a false otherwise.
 *   @param pidOfCallingTask
 * Process ID of calling user task. The operation is permitted only for tasks belonging to
 * those processes, which
 * have an ID that is greater of equal to the minimum specified for the event in question.
 * Otherwise an exception is raised, which aborts the calling task.
 *   @param idEvent
 * The ID of the event to trigger. This is the ID got from rtos_createEvent().
 *   @remark
 * This function must never be called directly. The function is only made for placing it in
 * the global system call table.
 */
uint32_t rtos_scFlHdlr_triggerEvent(unsigned int pidOfCallingTask, unsigned int idEvent)
{
    if(idEvent < _noEvents  &&  pidOfCallingTask >= _eventAry[idEvent].minPIDForTrigger)
        return (uint32_t)rtos_OS_triggerEvent(idEvent);
    else
    {
        /* The user specified task ID is not in range. This is a severe user code error,
           which is handled with an exception, task abort and counted error.
             Note, this function does not return. */
        ivr_systemCallBadArgument();
    }
} /* End of rtos_scFlHdlr_triggerEvent */


/**
 * System call handler implementation to create and run a task in another process. Find
 * more details in rtos_OS_runTask().\n
 *   Start a user task. A user task is a C function, which is executed in user mode and in
 * a given process context. The call is synchronous; the calling user context is
 * immediately preempted and superseded by the started task. The calling user context is
 * resumed when the task function ends - be it gracefully or by exception/abortion.\n
 *   The started task inherits the priority of the calling user task. It can be preempted
 * only by contexts of higher priority.\n
 *   The function requires sufficient privileges. By default the use of this function is
 * forbidden. The operating system startup code can however use
 * rtos_OS_grantPermissionRunTask() to enable particular pairs of calling and target
 * process for this service. The task can generally not be started in the OS context.\n
 *   The function cannot be used recursively. The created task cannot in turn make use of
 * rtos_runTask().
 *   @return
 * The executed task function can return a value, which is propagated to the calling user
 * context if it is positive. A returned negative task function result is interpreted as
 * failing task and rtos_runTask() returns #IVR_CAUSE_TASK_ABBORTION_USER_ABORT instead.
 * Furthermore, this event is counted as process error in the target process.
 *   @param pTaskConfig
 * The read-only configuration data for the task. In particular the task function pointer
 * and the ID of the target process.
 *   @param pTaskParam
 * This argument is meaningless to the function. The value is just passed on to the started
 * task function. The size is large enough to convey a pointer.
 *   @remark
 * This function must never be called directly. The function is only made for placing it in
 * the global system call table.
 */
uint32_t rtos_scFlHdlr_runTask( unsigned int pidOfCallingTask
                              , const prc_userTaskConfig_t *pUserTaskConfig
                              , uintptr_t taskParam
                              )
{
    if(!sc_checkUserCodeReadPtr(pUserTaskConfig, sizeof(prc_userTaskConfig_t)))
    {
        /* User code passed in an invalid pointer. We must not even touch the contents.
             Note, the next function won't return. */
        ivr_systemCallBadArgument();
    }

    /* This code depends on specific number of processes, we need a check. The
       implementation requires consistent maintenance with other function
       rtos_grantPermissionRunTask() */
#if PRC_NO_PROCESSES != 4
# error Implementation requires the number of processes to be four
#endif

